# USE CASE
## Create a student database stored as .sqlite
Inside the database, create three tables.

- One table for students = student_id, first_name, last_name, age, gender
- Second table for courses = course_id, course_name, credits
- Third table for enrollments = enrollment_id, student_id, course_id, enrollment_date, grade

Once complete, commit and close

In [54]:
# Import necessary libraries
import pandas as pd
import sqlite3

In [55]:
# Create the database and the tables
conn = sqlite3.connect('student.sqlite')
cur = conn.cursor()

In [56]:
# Insert data into the tables
table1 = """
CREATE TABLE Students(
    student_id INT PRIMARY KEY NOT NULL,
    first_name CHAR(20) NOT NULL,
    last_name CHAR(20) NOT NULL,
    age INT,
    gender CHAR(10)
);
"""

table2 = """
CREATE TABLE Courses(
    course_id INT PRIMARY KEY NOT NULL,
    course_name CHAR(50) NOT NULL,
    credits INT
);
"""

table3 = """
CREATE TABLE Enrollment(
    enrollment_id INT PRIMARY KEY NOT NULL,
    course_id INT,
    student_id INT,
    enrollment_date CHAR(20),
    grade CHAR(2),
    FOREIGN KEY (student_id) REFERENCES Students(student_id),
    FOREIGN KEY (course_id) REFERENCES Courses(course_id)
);
"""

In [57]:
cur.execute(table1)
cur.execute(table2)
cur.execute(table3)

In [58]:
#Data
from datetime import date

query1 = ("""
  INSERT INTO Students VALUES
    (0, 'Alice', 'Johnson', 20, 'Female'),
    (1, 'Bob', 'Smith', 22, 'Male'),
    (2, 'Charlie', 'Williams', 19, 'Male'),
    (3, 'Diana', 'Brown', 21, 'Female'),
    (4, 'Ethan', 'Davis', 23, 'Male')
""")
cur.execute(query1)

query2 = ("""
    INSERT INTO Courses VALUES
        (0,'Mathematics', 3),
        (1,'Physics', 4),
        (2,'Chemistry', 3),
        (3,'Literature', 2)
          """
)
cur.execute(query2)

enroll_date = date(2025, 4, 9).isoformat()

query3 = f"""
INSERT INTO Enrollment VALUES
    (1, 0, 3, '{enroll_date}', 'A'),
    (2, 1, 2, '{enroll_date}', 'B+'),
    (3, 2, 1, '{enroll_date}', 'A-'),
    (4, 3, 0, '{enroll_date}', 'B'),
    (5, 4, 3, '{enroll_date}', 'A'),
    (6, 3, 2, '{enroll_date}', 'B+'),
    (7, 4, 1, '{enroll_date}', 'A-'),
    (8, 1, 0, '{enroll_date}', 'B');
"""

cur.execute(query3)

In [59]:
# Connect to the database (using both the terminal and python)

In [60]:
# View the existing tables
pd.read_sql("""
SELECT * FROM Students;
""", conn)

   student_id first_name last_name  age  gender
0           0      Alice   Johnson   20  Female
1           1        Bob     Smith   22    Male
2           2    Charlie  Williams   19    Male
3           3      Diana     Brown   21  Female
4           4      Ethan     Davis   23    Male

In [61]:
pd.read_sql("""
SELECT * FROM Courses;
""", conn)

   course_id  course_name  credits
0          0  Mathematics        3
1          1      Physics        4
2          2    Chemistry        3
3          3   Literature        2

In [62]:
pd.read_sql("""
SELECT * FROM Enrollment;
""", conn)

   enrollment_id  course_id  student_id enrollment_date grade
0              1          0           3      2025-04-09     A
1              2          1           2      2025-04-09    B+
2              3          2           1      2025-04-09    A-
3              4          3           0      2025-04-09     B
4              5          4           3      2025-04-09     A
5              6          3           2      2025-04-09    B+
6              7          4           1      2025-04-09    A-
7              8          1           0      2025-04-09     B

In [63]:
# Select all female students
pd.read_sql("""
SELECT * 
       FROM Students 
       WHERE gender = "Female";
""", conn)

   student_id first_name last_name  age  gender
0           0      Alice   Johnson   20  Female
1           3      Diana     Brown   21  Female

In [64]:
# Show the two oldest students
pd.read_sql("""
SELECT *
            FROM Students
            ORDER BY age DESC
            LIMIT 2
""", conn)

   student_id first_name last_name  age gender
0           4      Ethan     Davis   23   Male
1           1        Bob     Smith   22   Male

In [65]:
# Count the students per gender
pd.read_sql("""
SELECT 
    COUNT(student_id) As female_count
FROM Students
WHERE gender = 'Female';
""", conn)

   female_count
0             2

In [66]:
# Show the full names using an alias
pd.read_sql("""
SELECT 
    first_name || ' ' || last_name AS full_name
FROM Students;
""", conn)

          full_name
0     Alice Johnson
1         Bob Smith
2  Charlie Williams
3       Diana Brown
4       Ethan Davis

In [67]:
# Filter the data to show the age of students above 20
# Use both WHERE and HAVING as different queries

In [68]:
pd.read_sql("""
SELECT * 
            FROM Students
            WHERE age > 20;
""",conn)

   student_id first_name last_name  age  gender
0           1        Bob     Smith   22    Male
1           3      Diana     Brown   21  Female
2           4      Ethan     Davis   23    Male

In [69]:
# Use an inner join to show students with their course names

In [70]:
# Find students not enrolled in any course

In [71]:
# Perform all the joins

In [72]:
# Explain the relationships
# If not existing, add tables to help show all the relationships